<a href="https://colab.research.google.com/github/jrfanfan/Android_temp_con/blob/main/housing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install scikit-learn==1.5.2

In [ ]:
import pandas as pd

housing = pd.read_csv('https://raw.githubusercontent.com/byui-cse/cse450-course/master/data/housing.csv')
housing.head()

In [3]:
date_year = pd.to_datetime(housing['date']).dt.year
date_year

0        2014
1        2015
2        2014
3        2014
4        2014
         ...
19995    2014
19996    2014
19997    2014
19998    2014
19999    2015
Name: date, Length: 20000, dtype: int32